/* eslint-disable prettier/prettier */
import { NavLink } from 'react-router-dom';

import PaxLogo from '../../assets/images/pax-white.svg';
import { RoutesPath } from 'shared/routes-path';

export default function Footer() {
  return (
    <footer className="mx-auto mb-0 mt-16 max-w-[1227px] rounded-t-brand-32 bg-[#151518] p-[32px] text-white lg:mb-[32px] lg:rounded-[48px] lg:p-[50px]">
      <div className="flex flex-col justify-between gap-10 md:flex-row">
        <div className="flex flex-col justify-between">
          <img src={PaxLogo} alt="" className="max-w-[86px]" />
          <p className="mt-4 hidden text-[16px] text-gray-500 md:mt-0 lg:block">
            © PAX{' '}{new Date().getFullYear()}
          </p>
        </div>

        <div className="flex flex-col gap-[40px] text-base lg:flex-row lg:gap-[180px]">
          <nav className="flex flex-col gap-[12px]">
            <div>
              <NavLink to={RoutesPath.MAIN} className="border-b border-transparent text-white hover:border-gray-600">
                Smart-аптека
              </NavLink>
            </div>
            <div>
              <NavLink to={RoutesPath.PRODCUT} className="border-b border-transparent text-white hover:border-gray-600">
                Врачам/Компаниям
              </NavLink>
            </div>
            <div>
              <NavLink to={RoutesPath.REVIEWS} className="border-b border-transparent text-white hover:border-gray-600">
                Отзывы
              </NavLink>
            </div>
            <div>
              <NavLink to={RoutesPath.ABOUT} className="border-b border-transparent text-white hover:border-gray-600">
                О нас
              </NavLink>
            </div>
            <div>
              <NavLink to={RoutesPath.CONTACTS} className="border-b border-transparent text-white hover:border-gray-600">
                Контакты
              </NavLink>
            </div>
          </nav>
          <nav className="flex flex-col gap-[12px] ">
            <div>
              <NavLink to="" className="border-b border-transparent text-white hover:border-gray-600">
                Сертификаты
              </NavLink>
            </div>
            <div>
              <NavLink to="" className="border-b border-transparent text-white hover:border-gray-600">
                Договор оферты
              </NavLink>
            </div>
            <div>
              <NavLink to="" className="border-b border-transparent text-white hover:border-gray-600">
                Политика конфиденциальности
              </NavLink>
            </div>
            <div>
              <NavLink to="" className="border-b border-transparent text-white hover:border-gray-600">
                Пользовательское соглашение
              </NavLink>
            </div>
            <div>
              <NavLink to="" className="border-b border-transparent text-white hover:border-gray-600">
                Бонусная программа
              </NavLink>
            </div>
          </nav>
        </div>

        <div className="flex flex-col items-start gap-4 md:items-end">
          <a
            href="tel:+74950000000"
            className="text-[26px] font-semibold text-white"
          >
            +7 495 000 00 00
          </a>
          <div className="flex gap-3">
            <a href="#" className="group">
              <svg
                width="40"
                height="40"
                viewBox="0 0 40 40"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="block transition-all duration-200 group-hover:hidden"
              >
                <rect
                  width="40"
                  height="40"
                  rx="20"
                  fill="white"
                  fillOpacity="0.12"
                />
                <path
                  d="M11.1281 19.2916C11.1281 19.2916 19.266 15.864 22.0883 14.6571C23.1702 14.1744 26.8393 12.6295 26.8393 12.6295C26.8393 12.6295 28.5328 11.9537 28.3916 13.5951C28.3446 14.2709 27.9683 16.6364 27.592 19.195C27.0275 22.8157 26.416 26.7743 26.416 26.7743C26.416 26.7743 26.3219 27.8847 25.5222 28.0778C24.7226 28.2708 23.4054 27.4019 23.1702 27.2088C22.982 27.064 19.6423 24.8916 18.4192 23.8295C18.0899 23.5398 17.7136 22.9606 18.4662 22.2847C20.1597 20.6916 22.1824 18.7123 23.4054 17.4571C23.9699 16.8778 24.5344 15.5261 22.1824 17.1674C18.8426 19.533 15.5498 21.7537 15.5498 21.7537C15.5498 21.7537 14.7972 22.2364 13.386 21.8019C11.9747 21.3675 10.3283 20.7881 10.3283 20.7881C10.3283 20.7881 9.19946 20.064 11.1281 19.2916Z"
                  fill="white"
                />
              </svg>
              <svg
                width="40"
                height="40"
                viewBox="0 0 40 40"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="hidden transition-all duration-200 group-hover:block"
              >
                <rect width="40" height="40" rx="20" fill="#34AADF" />
                <path
                  d="M11.1281 19.2916C11.1281 19.2916 19.266 15.864 22.0883 14.6571C23.1702 14.1744 26.8393 12.6295 26.8393 12.6295C26.8393 12.6295 28.5328 11.9537 28.3916 13.5951C28.3446 14.2709 27.9683 16.6364 27.592 19.195C27.0275 22.8157 26.416 26.7743 26.416 26.7743C26.416 26.7743 26.3219 27.8847 25.5222 28.0778C24.7226 28.2708 23.4054 27.4019 23.1702 27.2088C22.982 27.064 19.6422 24.8916 18.4192 23.8295C18.0899 23.5398 17.7136 22.9606 18.4662 22.2847C20.1597 20.6916 22.1824 18.7123 23.4054 17.4571C23.9699 16.8778 24.5344 15.5261 22.1824 17.1674C18.8426 19.533 15.5498 21.7537 15.5498 21.7537C15.5498 21.7537 14.7972 22.2364 13.386 21.8019C11.9747 21.3675 10.3283 20.7881 10.3283 20.7881C10.3283 20.7881 9.19946 20.064 11.1281 19.2916Z"
                  fill="white"
                />
              </svg>
            </a>
            <a href="#" className="group">
              <svg
                width="40"
                height="40"
                viewBox="0 0 40 40"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="block transition-all duration-200 group-hover:hidden"
              >
                <rect
                  width="40"
                  height="40"
                  rx="20"
                  fill="white"
                  fillOpacity="0.08"
                />
                <path
                  d="M10 29.2595L11.435 23.924C10.2777 21.8455 9.91003 19.4202 10.3994 17.0929C10.8888 14.7657 12.2024 12.6927 14.0992 11.2543C15.996 9.81594 18.3487 9.1087 20.7256 9.26236C23.1026 9.41602 25.3443 10.4203 27.0394 12.0908C28.7345 13.7614 29.7694 15.9862 29.9541 18.357C30.1387 20.7279 29.4608 23.0856 28.0447 24.9977C26.6286 26.9098 24.5694 28.248 22.2448 28.7666C19.9202 29.2853 17.4863 28.9496 15.3896 27.8213L10 29.2595ZM15.6494 25.8247L15.9827 26.0221C17.5014 26.9207 19.2752 27.2926 21.0277 27.0798C22.7802 26.8669 24.4129 26.0813 25.6715 24.8453C26.9301 23.6093 27.7437 21.9924 27.9857 20.2466C28.2277 18.5007 27.8844 16.724 27.0093 15.1933C26.1342 13.6625 24.7765 12.4638 23.1478 11.7838C21.519 11.1039 19.7108 10.9809 18.0047 11.4341C16.2986 11.8873 14.7907 12.8912 13.7158 14.2893C12.6409 15.6874 12.0594 17.4013 12.062 19.1638C12.0606 20.6251 12.4654 22.0583 13.2315 23.3036L13.4405 23.6476L12.6383 26.6256L15.6494 25.8247Z"
                  fill="white"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M23.7394 20.5339C23.544 20.3765 23.3152 20.2658 23.0704 20.2101C22.8257 20.1544 22.5714 20.1552 22.327 20.2124C21.9598 20.3647 21.7225 20.94 21.4853 21.2276C21.4352 21.2965 21.3617 21.3449 21.2785 21.3636C21.1953 21.3823 21.1081 21.37 21.0333 21.3291C19.6889 20.8034 18.5621 19.8394 17.8357 18.5937C17.7738 18.5159 17.7445 18.4172 17.754 18.3184C17.7634 18.2195 17.811 18.1281 17.8866 18.0635C18.1512 17.802 18.3455 17.478 18.4515 17.1216C18.4751 16.7285 18.3849 16.337 18.1917 15.9936C18.0423 15.5123 17.758 15.0837 17.3725 14.7584C17.1736 14.6692 16.9531 14.6392 16.7376 14.6722C16.5221 14.7053 16.3207 14.7998 16.1579 14.9446C15.8751 15.1881 15.6506 15.4919 15.5011 15.8335C15.3515 16.1752 15.2805 16.546 15.2935 16.9186C15.2944 17.1278 15.3209 17.3362 15.3726 17.539C15.5038 18.0262 15.7055 18.4918 15.9714 18.9208C16.1633 19.2495 16.3726 19.5676 16.5985 19.874C17.3327 20.8802 18.2556 21.7345 19.3159 22.3894C19.848 22.7223 20.4167 22.9929 21.0107 23.196C21.6278 23.4752 22.3092 23.5824 22.9824 23.5062C23.3659 23.4482 23.7294 23.297 24.0407 23.0659C24.352 22.8348 24.6016 22.5308 24.7676 22.1808C24.8651 21.9693 24.8947 21.7329 24.8523 21.504C24.7506 21.0358 24.1236 20.7595 23.7394 20.5339Z"
                  fill="white"
                />
              </svg>

              <svg
                width="40"
                height="40"
                viewBox="0 0 40 40"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="hidden transition-all duration-200 group-hover:block"
              >
                <rect width="40" height="40" rx="20" fill="#00D95F" />
                <path
                  d="M10 29.2595L11.435 23.924C10.2777 21.8455 9.91003 19.4202 10.3994 17.0929C10.8888 14.7657 12.2024 12.6927 14.0992 11.2543C15.996 9.81594 18.3487 9.1087 20.7256 9.26236C23.1026 9.41602 25.3443 10.4203 27.0394 12.0908C28.7345 13.7614 29.7694 15.9862 29.9541 18.357C30.1387 20.7279 29.4608 23.0856 28.0447 24.9977C26.6286 26.9098 24.5694 28.248 22.2448 28.7666C19.9202 29.2853 17.4863 28.9496 15.3896 27.8213L10 29.2595ZM15.6494 25.8247L15.9827 26.0221C17.5014 26.9207 19.2752 27.2926 21.0277 27.0798C22.7802 26.8669 24.4129 26.0813 25.6715 24.8453C26.9301 23.6093 27.7437 21.9924 27.9857 20.2466C28.2277 18.5007 27.8844 16.724 27.0093 15.1933C26.1342 13.6625 24.7765 12.4638 23.1478 11.7838C21.519 11.1039 19.7108 10.9809 18.0047 11.4341C16.2986 11.8873 14.7907 12.8912 13.7158 14.2893C12.6409 15.6874 12.0594 17.4013 12.062 19.1638C12.0606 20.6251 12.4654 22.0583 13.2315 23.3036L13.4405 23.6476L12.6383 26.6256L15.6494 25.8247Z"
                  fill="white"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M23.7394 20.5339C23.544 20.3765 23.3152 20.2658 23.0704 20.2101C22.8257 20.1544 22.5714 20.1552 22.327 20.2124C21.9598 20.3647 21.7225 20.94 21.4853 21.2276C21.4352 21.2965 21.3617 21.3449 21.2785 21.3636C21.1953 21.3823 21.1081 21.37 21.0333 21.3291C19.6889 20.8034 18.5621 19.8394 17.8357 18.5937C17.7738 18.5159 17.7445 18.4172 17.754 18.3184C17.7634 18.2195 17.811 18.1281 17.8866 18.0635C18.1512 17.802 18.3455 17.478 18.4515 17.1216C18.4751 16.7285 18.3849 16.337 18.1917 15.9936C18.0423 15.5123 17.758 15.0837 17.3725 14.7584C17.1736 14.6692 16.9531 14.6392 16.7376 14.6722C16.5221 14.7053 16.3207 14.7998 16.1579 14.9446C15.8751 15.1881 15.6506 15.4919 15.5011 15.8335C15.3515 16.1752 15.2805 16.546 15.2935 16.9186C15.2944 17.1278 15.3209 17.3362 15.3726 17.539C15.5038 18.0262 15.7055 18.4918 15.9714 18.9208C16.1633 19.2495 16.3726 19.5676 16.5985 19.874C17.3327 20.8802 18.2556 21.7345 19.3159 22.3894C19.848 22.7223 20.4167 22.9929 21.0107 23.196C21.6278 23.4752 22.3091 23.5824 22.9824 23.5062C23.3659 23.4482 23.7294 23.297 24.0407 23.0659C24.352 22.8348 24.6016 22.5308 24.7676 22.1808C24.8651 21.9693 24.8947 21.7329 24.8523 21.504C24.7506 21.0358 24.1236 20.7595 23.7394 20.5339Z"
                  fill="white"
                />
              </svg>
            </a>
          </div>
        </div>
      </div>
      <p className="mt-[40px] text-[16px] text-gray-500 md:mt-0 lg:hidden">
        © PAX{' '}{new Date().getFullYear()}
      </p>
    </footer>
  );
}
